src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccumulationRegister.Покупатели</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Банк</registerRecords>
  <registerRecords>AccumulationRegister.Касса</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПКО</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.Статьи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВДоходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидыОперацийПКО/ВидыОперацийПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПКО</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОплатаПокупателя</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПолучениеНаличныхВБанке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочийПриход</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.Покупатели</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйКонтакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаениеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПриходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Основание = Параметры.Основание;
		
		Если ЗначениеЗаполнено(Основание) Тогда // создан на основании
			
			Объект.Основание	= Основание;
			ТекстОснование		= Основание;
			
			Объект.Контрагент 	= Основание.Контрагент;
			Объект.Сумма		= Основание.Сумма;
			
			Объект.ВидОперации	= Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Средства, полученные от покупателей и заказчиков");
			Объект.Касса		= Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)");
			Объект.Валюта		= Объект.Касса.ВалютаДенежныхСредств;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда // Новый, НЕ скопирован
			
			Объект.ВидОперации	= Перечисления.ВидыОперацийПКО.ПрочийПриход;
			Объект.Статья		= Справочники.Статьи.НайтиПоНаименованию("Прочие доходы");
			Объект.Касса		= Справочники.Кассы.НайтиПоНаименованию("Касса (RUB)");
			Объект.Валюта		= Объект.Касса.ВалютаДенежныхСредств;
			
			Элементы.Контрагент.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОснование = Объект.Основание;
	
	УправлениеВидимостью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	КассаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперации_ПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Основание);
	
	ОткрытьФорму("Документ.Реализация.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяПриИзменении(Элемент)
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФлагомВключатьВДоходыРасходы()
	
	а1 = (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке);
	а2 = Объект.Статья.НеВключатьВДоходы;
	
	Объект.НеВключатьВДоходы = (а1 ИЛИ а2);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	
	Элементы.СуммаВал.Видимость 	= (Объект.Валюта.Код <> "643");
	Элементы.Счет.Видимость			= (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ПолучениеНаличныхВБанке);
	Элементы.Контрагент.Видимость	= (Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя);
	
КонецПроцедуры

&НаСервере
Процедура КассаПриИзмененииСервер()
	
	Объект.Валюта = Объект.Касса.ВалютаДенежныхСредств;
	УправлениеВидимостью();
	
КонецПроцедуры

&НаСервере
Процедура ВидОперации_ПриИзмененииСервер()
	
	Объект.Основание	= "";
	ТекстОснование		= "";
	
	УправлениеВидимостью();
	УправлениеФлагомВключатьВДоходыРасходы();
	
КонецПроцедуры

#КонецОбласти
